src/InformationRegisters/ИсторияИзмененияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзмененияОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РелизКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолноеИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИсторияИзмененияОбъектов/Ext/ManagerModule.bsl
Функция ПоказатьИзмененныеОбъекты(ИдентификаторСообщения = "", ПолноеИмяОбъекта = "", РелизКонфигурации = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсторияИзмененияОбъектов.ИдентификаторСообщения,
	|	ИсторияИзмененияОбъектов.ПолноеИмяОбъекта,
	|	ИсторияИзмененияОбъектов.РелизКонфигурации,
	|	ИсторияИзмененияОбъектов.НомерКартинки
	|ИЗ
	|	РегистрСведений.ИсторияИзмененияОбъектов КАК ИсторияИзмененияОбъектов
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИспользоватьИдентификатор
	|				ТОГДА ИсторияИзмененияОбъектов.ИдентификаторСообщения = &ИдентификаторСообщения
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ИспользоватьИмяОбъекта
	|				ТОГДА ИсторияИзмененияОбъектов.ПолноеИмяОбъекта = &ПолноеИмяОбъекта
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ИспользоватьРелиз
	|				ТОГДА ИсторияИзмененияОбъектов.РелизКонфигурации = &РелизКонфигурации
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("ИдентификаторСообщения", 	ИдентификаторСообщения);
	Запрос.УстановитьПараметр("ИспользоватьИдентификатор",	ЗначениеЗаполнено(ИдентификаторСообщения));
	Запрос.УстановитьПараметр("ПолноеИмяОбъекта", 			ПолноеИмяОбъекта);
	Запрос.УстановитьПараметр("ИспользоватьИмяОбъекта", 	ЗначениеЗаполнено(ПолноеИмяОбъекта));
	Запрос.УстановитьПараметр("РелизКонфигурации", 			РелизКонфигурации);
	Запрос.УстановитьПараметр("ИспользоватьРелиз", 			ЗначениеЗаполнено(РелизКонфигурации));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивСтруктур = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Струкрура = Новый Структура;
		Струкрура.Вставить("ИдентификаторСообщения",	Выборка.ИдентификаторСообщения);
		Струкрура.Вставить("ПолноеИмяОбъекта",			Выборка.ПолноеИмяОбъекта);
		Струкрура.Вставить("РелизКонфигурации",			Выборка.РелизКонфигурации);
		Струкрура.Вставить("НомерКартинки",				Выборка.НомерКартинки);
		МассивСтруктур.Добавить(Струкрура);		
	КонецЦикла;	
	
	Возврат МассивСтруктур;
	
КонецФункции
